
//DHCP Router
Router(config)#service dhcp //Se activa el Servicio
Router(config)#ip dhcp excluded-address <ipmin> <ipmax> //Le damos un rango de IPS a excluir del direccionamiento, Para Switch, Server y otros
Router(config)#ip dhcp pool <nombre> //Le damos un nombre al Pool de direccionamiento
Router(DHCP-config)#network <ip-de-la-red> <mascara> //Le decimos el Pool de direcciones IP
Router(DHCP-config)#default-router 192.168.1.1 //Se�alamos la IP que ser� la puerta de enlace
Router(DHCP-config)#dns-server <ip-server> //Indicamos la IP del servidor DNS que utilizaran los hosts


//OSPF
Router(config)# route osp <processID> // <processID> 0 hasta 65535
Router(config-router)# router-id <num-ip> // Se ingreda un id cualquiera en formato ip, pero no es una ip. Es opcional porque en OSPFv2 si no esta definido
se usa la direccion mas alta de las interfaces loopback configuradas. Si no hay loopback, se toma la ip mas alta de las interfaces fisicas que se encuentren operativas al momento de levantar el proceso. So mp hay omterfaces fisicas operativas, el proceso ospf no se inicia.
Router(config-router)# netword <ip-de-la-red> <Wildcard> area <num=0>

//EIGRP
Router(config)# route eigrp <ID>
Router(config-router)# network <ip-de-red> <Wildcard> //Mascara de subred al reves
Router(config-router)# exit

//Bloquear AccessList
Router(config)# access-list <numACL> permit|deny <ip> [wild-mask] //crea la lista de bloqueos 
numACL: 1-99

Router(config)# interface <interface>
Router(config-if)# ip access-group numACL in|out
in: tr�fico a filtrar que ENTRA por la interfaz del router
out : tr�fico a filtrar que SALE por la interfaz del router. 
wild-mask: indica con 0 el bit a evaluar y con 1 indica que el bit correspondiente se ignora. Por ejemplo, si queremos indicar un �nico host 192.168.1.1 especifico: 192.168.1.1 con wild-mask 0.0.0.0 y si queremos especificar toda la red clase C correspondiente lo hacemos con 192.168.1.0 y wild-mask 0.0.0.255. 

Router# show access-list
-----------------------------------------------------------------------------------------------------------
VLAN: VLAN 1 es la vlan nativa
Switch:

Switch(config)# show vlan brief
Switch(config)# show vlan
Switch# erase startup-config
Switch# delete flash:vlan.dat //sin estacio entre medio


{Usar este
Switch(config)# vlan database
Switch(vlan)#vlan <n�mero de vlan> name <nombre de vlan>
}
{ o este hacen lo mismo
Switch(config)# vlan <n vlan>
Switch(config-vlan)# name <nombre>
Switch(config-vlan)# exit
}

Switch(config)# interface range f0/1-3 //Configura los 3 interfaces a la vez
Switch(config-if-range)# switchport mode access //opcional
Switch(config-if-range)# switchport access vlan <n vlan> //Asigna el puerto a vlan

Switch troncal:
Switch(config)#interface <puerto-a-router>
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan 2-4 //Por aca circularan las VLAN de la 2 a la 4. Opcional
Switch(config-if)# exit

Router Troncal:
Router(config)# 
Router(config-if)#interface <puerto-Switch>.<numero> //Configurar uno para cada vlan
Router(config-subif)#encapsulation dot1Q  <N�mero de la VLAN>
Router(config-subif)#ip address <ip-de-la-red> <Mascara>

VTP
show vtp status
Switch(config)# vtp mode [server|transparent|client]
Switch(config)#	vtp domain <nombre>
Switch(config)# vtp password <password>
Switch(config)# vtp pruning //Solo hacer en el switch server
---------------------------------------------------------------------
DHCP Server Externo
R1(config)#interface fastethernet0/0 //interfaz de puerta de acceso
R1(config-if)#ip helper-address 40.0.0.10 //direccion de el servidor dhcp
R1(config-if)#exit

---------------------------------------------------------
Switch:

ip default-gateway <ip-de-red vlan>

---------------------------------------------------------
Telefonos
En DHCP:
RouterA(dhcp-config)#option 150 ip <gateway-red> // Habilita para descargar la conf de los telefonos tftp. Se proporciona la ip de la red que se esta configurando en el dhcp (la red dada al pool).

Activar la comunicacion de los telefonos (CallManager) en router:
RouterA(config)# telephony-service //Activador
RouterA(config-telephony)# max-dn <num> //Numero maximo de directorios habilitados
RouterA(config-telephony)# max-ephones <num> //Numero maximo de tel�fonos IP conectados
RouterA(config-telephony)# ip source-address <Gateway-VLANVoz> port 2000 //IP de la cual surge la transmisi�n (la puerta de acceso de esa ip)
RouterA(config-telephony)# auto assign 4 to 6 //Ordenamos la auto asignaci�n de funciones en los botones
RouterA(config-telephony)# auto assign 1 to 5
exit

Configurar una voice lan sobre el switch: No configurar switchport access vlan en la misma vlan de voz en caso de tambien usar datos.
Switch(config)#interface <interfaz> //Configure interface. Se puede usar range
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport voice vlan 1 //Define la VLAN en la cual los paquetes de voz van a ser manejados

Configura el directorio de telefono para un telefono
RouterA(config)#ephone-dn <num=1> //Define la primera entrada al directorio //cada telefono tiene un directorio
RouterA(config-ephone-dn)#number 54001 //asigna el telefono a este directorio

CONFIGURACION DE LOS TELEFONOS A NIVEL WAN
 configuracion CME

ROUTER SEDE 1 (INTERFAZ DEL SERIAL 200.150.0.1)
RouterA(config)#dial-peer voice <etiqueta> voip //Es una practica asociar el numero de la etiqueta con el del directorio.
RouterA(config-dial-peer)#destination-pattern 5400. //(EL PUNTO AL FINAL ES IMPORTANTE) telefonos 5400x
RouterA(config-dial-peer)#session target ipv4:200.150.0.2 (AQUI VA LA IP DE LA INTERFAZ WAN DEL ROUTER DE LAS SEDE 2)
exit

ROUTER SEDE 2 (INTERFAZ DEL SERIAL 200.150.0.2)
RouterA(config)#dial-peer voice <etiqueta2> voip
RouterA(config-dial-peer)#destination-pattern 5400. (EL PUNTO AL FINAL ES IMPORTANTE)
RouterA(config-dial-peer)#session target ipv4:200.150.0.1 (AQUI VA LA IP DE LA INTERFAZ WAN DEL ROUTER DE LAS SEDE 1)
exit


