
//DHCP Router
Router(config)#service dhcp //Se activa el Servicio
Router(config)#ip dhcp excluded-address <ipmin> <ipmax> //Le damos un rango de IPS a excluir del direccionamiento, Para Switch, Server y otros
Router(config)#ip dhcp pool <nombre> //Le damos un nombre al Pool de direccionamiento
Router(DHCP-config)#network <ip-de-la-red> <mascara> //Le decimos el Pool de direcciones IP
Router(DHCP-config)#default-router 192.168.1.1 //Se�alamos la IP que ser� la puerta de enlace
Router(DHCP-config)#dns-server <ip-server> //Inaskcasklcaklscdicamos la IP del servidor DNS que utilizaran los hosts


//OSPF
Router(config)# route osp <processID> // <processID> 0 hasta 65535
Router(config-router)# router-id <num-ip> // Se ingreda un id cualquiera en formato ip, pero no es una ip. Es opcional porque en OSPFv2 si no esta definido
se usa la direccion mas alta de las interfaces loopback configuradas. Si no hay loopback, se toma la ip mas alta de las interfaces fisicas que se encuentren operativas al momento de levantar el proceso. So mp hay omterfaces fisicas operativas, el proceso ospf no se inicia.
Router(config-router)# netword <ip-de-la-red> <Wildcard> area <num=0>

//EIGRP
Router(config)# route eigrp <ID>
Router(config-router)# network <ip-de-red> <Wildcard> //Mascara de subred al reves
Router(config-router)# exit

//Bloquear AccessList
Router(config)# access-list <numACL> permit|deny <ip> [wild-mask] //crea la lista de bloqueos 
numACL: 1-99

Router(config)# interface <interface>
Router(config-if)# ip access-group numACL in|out
in: tr�fico a filtrar que ENTRA por la interfaz del router
out : tr�fico a filtrar que SALE por la interfaz del router. 
wild-mask: indica con 0 el bit a evaluar y con 1 indica que el bit correspondiente se ignora. Por ejemplo, si queremos indicar un �nico host 192.168.1.1 especifico: 192.168.1.1 con wild-mask 0.0.0.0 y si queremos especificar toda la red clase C correspondiente lo hacemos con 192.168.1.0 y wild-mask 0.0.0.255. 

Router# show access-list
-----------------------------------------------------------------------------------------------------------
VLAN: VLAN 1 es la vlan nativa
Switch:

Switch(config)# show vlan brief
Switch(config)# show vlan
Switch# erase startup-config
Switch# delete flash:vlan.dat //sin estacio entre medio


{Usar este
Switch(config)# vlan database
Switch(vlan)#vlan <n�mero de vlan> name <nombre de vlan>
}
{ o este hacen lo mismo
Switch(config)# vlan <n vlan>
Switch(config-vlan)# name <nombre>
Switch(config-vlan)# exit
}

Switch(config)# interface range f0/1-3 //Configura los 3 interfaces a la vez
Switch(config-if-range)# switchport mode access //opcional
Switch(config-if-range)# switchport access vlan <n vlan> //Asigna el puerto a vlan

Switch troncal:
Switch(config)#interface <puerto-a-router>
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan 2-4 //Por aca circularan las VLAN de la 2 a la 4. Opcional
Switch(config-if)# exit
