
----------------------------------------------------------------------------------------------------------
Router:

Router> enable //Acceder al modo privilegiado (EXEC). (si se ingresa solo: en, se reconoce el comando).

Router# erase startup-config //Elimina la configuracion del dispositivo.

Router# reload //Se recargan el dispositivo, si aparece la opcion de AutoInstall, rechazar.

Router# configure terminal //Para entrar la configuracion del dispositivo.

El comando anterior deberia dejar los siguiente:
Router(config)#

Router(config)# exit //En este caso para salir de la configuracion.

Router# ? //Lista de comandos se visualizan. Si aparece el mensaje --More-- al final, presionar BARRA ESPACIADORA para
					     visualizar el resto de comandos o ENTER para ver SOLO la siguiente linea.

Router(config)# hostname <nombre> //Este comando es para renombrar el dispositivo actual. En <nombre> se ingresa el nombre
				    deseado para el dispositivo. Ejemplo:
Router(config)# hostname R1 ==> R1(config)#

Mantendremos el nombre modificado del comando anterior para los siguientes ejemplos.

R1(config)# no ip domain-lookup //Desactiva la busqueda de DNS del dispositvo.

R1(config)# enable secret class //Contrase�a para entrar el modo EXEC, en este caso la clave es "class".

R1(config)# no enable password //Para eliminar el comando, ya que se configuro anteriormente con "enable secret".

R1(config)# banner motd & //Para configurar un mensaje que aparece en el arranque del dispositivo.
			    Para terminar o cerrar el mensaje solo hay que insertar un "&".

//Configurar contrase�a para la consola:
R1(config)# line console 0 //Para entrar al modo configuracion de linea.
R1(config-line)# password cisco //Asigna la clave, en este caso la clave es "cisco".
R1(config-line)# login //Ni idea.
R1(config-line)# exit //Para salir del modo configuracion de linea.
R1(config)#

//Configurar contrase�a para linea de terminal virtual (telnet):
R1(config)# line vty 0 4
R1(config-line)# password cisco //Asigna la clave, en este caso la clave es "cisco".
R1(config-line)# login //Ni idea.
R1(config-line)# exit //Para salir del modo configuracion de linea.
R1(config)#

//Configurar interfaz FastEthernet:
R1(config)# interface fastethernet <puerto>  //Para ingresar al modo configuracion de la interfaz. En <puerto> va 0/0 o 2/0 por ejemplo.			  
R1(config-if)# ip address <direccionIp> <mascara> //Para asignar la ip y la mascara.
R1(config-if)# no shutdown //Para encender el puerto.
R1(config-if)# description R1 LAN //Dar una descripcion a la interfaz

//Configurar interfaz Serial:
R1(config-if)# interface serial <puerto>  //Para ingresar al modo configuracion de la interfaz. En <puerto> va 0/0 o 2/0 por ejemplo.			  
R1(config-if)# ip address <direccionIp> <mascara> //Para asignar la ip y la mascara.
R1(config-if)# clock rate 64000  //Para asignar el tiempo del relog se usa en el lado DCE
R1(config-if)# no shutdown //Para encender el puerto.
R1(config-if)# description Link to R2 //Dar una descripcion a la interfaz.
